jelson/rulos/src/lib/chip/arm/stm32/core/dma.c
/*
 * Copyright (C) 2009 Jon Howell (jonh@jonh.net) and Jeremy Elson
 * (jelson@gmail.com).
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <https://www.gnu.org/licenses/>.
 */

/*
 * RULOS DMA abstraction layer implementation.
 *
 * See dma.h for API docs. Per-family backends live in the #if blocks
 * below. Phase 1 of the refactor ships only the G4 backend; G0 / F0 /
 * F1 / F3 / H5 / C0 backends land in subsequent phases. In the meantime
 * the non-G4 stubs let those families' nulltest builds keep compiling
 * while their peripheral drivers still use the old hardcoded paths.
 */

#include "dma.h"

#include <stddef.h>

#include "core/hal.h"
#include "core/hardware.h"  // for CCMRAM
#include "stm32.h"

// ============================================================================
// Classic DMA backend (DMA1/DMA2 with CCR register layout).
//
// Covers every STM32 family RULOS supports except H5:
//   - Fixed-map families (no DMAMUX): F0, F1, F3
//   - DMAMUX families (dynamic peripheral→channel routing): C0, G0, G4
//
// Everything except the allocator, init_channel's DMAMUX step, and
// the per-chip IRQ handlers is shared. The pool, request translation
// (either DMAMUX constant or fixed slot), public API, and IRQ
// dispatcher use LL macros that are defined identically across all
// six families.
// ============================================================================
#if defined(RULOS_ARM_stm32c0) || defined(RULOS_ARM_stm32f0) || \
    defined(RULOS_ARM_stm32f1) || defined(RULOS_ARM_stm32f3) || \
    defined(RULOS_ARM_stm32g0) || defined(RULOS_ARM_stm32g4)

#if defined(RULOS_ARM_stm32c0) || defined(RULOS_ARM_stm32g0) || \
    defined(RULOS_ARM_stm32g4)
#define RULOS_DMA_HAS_DMAMUX 1
#else
#define RULOS_DMA_HAS_DMAMUX 0
#endif

/*
 * Per-channel NVIC IRQ number. Two flavors:
 *
 *   Per-channel IRQs (G4, F1, F3): every DMA channel has its own
 *     dedicated IRQ line and handler.
 *
 *   Merged IRQs (C0, F0, G0): multiple channels share an IRQ line.
 *     Channels 2-3 share one line on C0, F0, and G0. Channels 4+
 *     (plus DMA2 on G0B1) share another "merged" line whose name
 *     depends on the chip variant. C0 only has three DMA channels
 *     so it doesn't need a Ch4+ merged line. Multiple slots holding
 *     the same IRQ number is fine -- NVIC_EnableIRQ is idempotent.
 */
#if defined(RULOS_ARM_stm32g4) || defined(RULOS_ARM_stm32f1) || \
    defined(RULOS_ARM_stm32f3)
// Per-channel IRQ families.
#define RULOS_DMA1_CH1_IRQN  DMA1_Channel1_IRQn
#define RULOS_DMA1_CH2_IRQN  DMA1_Channel2_IRQn
#define RULOS_DMA1_CH3_IRQN  DMA1_Channel3_IRQn
#define RULOS_DMA1_CH4_IRQN  DMA1_Channel4_IRQn
#define RULOS_DMA1_CH5_IRQN  DMA1_Channel5_IRQn
#ifdef DMA1_Channel6_BASE
#define RULOS_DMA1_CH6_IRQN  DMA1_Channel6_IRQn
#endif
#ifdef DMA1_Channel7_BASE
#define RULOS_DMA1_CH7_IRQN  DMA1_Channel7_IRQn
#endif
#ifdef DMA1_Channel8_BASE
#define RULOS_DMA1_CH8_IRQN  DMA1_Channel8_IRQn
#endif
#ifdef DMA2_Channel1_BASE
#define RULOS_DMA2_CH1_IRQN  DMA2_Channel1_IRQn
#define RULOS_DMA2_CH2_IRQN  DMA2_Channel2_IRQn
#define RULOS_DMA2_CH3_IRQN  DMA2_Channel3_IRQn
#if defined(RULOS_ARM_stm32f1)
// F1 high/XL-density merges DMA2 Ch4-5. CMSIS aliases DMA2_Channel4_IRQn
// to DMA2_Channel4_5_IRQn via a macro, so the Ch4 line below already
// points at the merged IRQn; we just have to use that same macro for
// Ch5 since DMA2_Channel5_IRQn doesn't exist on F1.
#define RULOS_DMA2_CH4_IRQN  DMA2_Channel4_IRQn
#define RULOS_DMA2_CH5_IRQN  DMA2_Channel4_IRQn
#else
#define RULOS_DMA2_CH4_IRQN  DMA2_Channel4_IRQn
#define RULOS_DMA2_CH5_IRQN  DMA2_Channel5_IRQn
#endif
#ifdef DMA2_Channel6_BASE
#define RULOS_DMA2_CH6_IRQN  DMA2_Channel6_IRQn
#endif
#ifdef DMA2_Channel7_BASE
#define RULOS_DMA2_CH7_IRQN  DMA2_Channel7_IRQn
#endif
#ifdef DMA2_Channel8_BASE
#define RULOS_DMA2_CH8_IRQN  DMA2_Channel8_IRQn
#endif
#endif  // DMA2_Channel1_BASE
#elif defined(RULOS_ARM_stm32g0)
// G0: merged IRQ lines.
#define RULOS_DMA1_CH1_IRQN  DMA1_Channel1_IRQn
#define RULOS_DMA1_CH2_IRQN  DMA1_Channel2_3_IRQn
#define RULOS_DMA1_CH3_IRQN  DMA1_Channel2_3_IRQn
#if defined(STM32G0B1xx)
#define RULOS_DMA_MERGED_IRQN  DMA1_Ch4_7_DMA2_Ch1_5_DMAMUX1_OVR_IRQn
#else
#define RULOS_DMA_MERGED_IRQN  DMA1_Ch4_5_DMAMUX1_OVR_IRQn
#endif
#define RULOS_DMA1_CH4_IRQN  RULOS_DMA_MERGED_IRQN
#define RULOS_DMA1_CH5_IRQN  RULOS_DMA_MERGED_IRQN
#ifdef DMA1_Channel6_BASE
#define RULOS_DMA1_CH6_IRQN  RULOS_DMA_MERGED_IRQN
#endif
#ifdef DMA1_Channel7_BASE
#define RULOS_DMA1_CH7_IRQN  RULOS_DMA_MERGED_IRQN
#endif
#ifdef DMA2_Channel1_BASE
#define RULOS_DMA2_CH1_IRQN  RULOS_DMA_MERGED_IRQN
#define RULOS_DMA2_CH2_IRQN  RULOS_DMA_MERGED_IRQN
#define RULOS_DMA2_CH3_IRQN  RULOS_DMA_MERGED_IRQN
#define RULOS_DMA2_CH4_IRQN  RULOS_DMA_MERGED_IRQN
#define RULOS_DMA2_CH5_IRQN  RULOS_DMA_MERGED_IRQN
#endif
#elif defined(RULOS_ARM_stm32c0)
// C0: Channel1 standalone, Ch2-3 merged. Only 3 channels total.
#define RULOS_DMA1_CH1_IRQN  DMA1_Channel1_IRQn
#define RULOS_DMA1_CH2_IRQN  DMA1_Channel2_3_IRQn
#define RULOS_DMA1_CH3_IRQN  DMA1_Channel2_3_IRQn
#else  // F0: Channel1 standalone, Ch2-3 and Ch4-5 merged.
#define RULOS_DMA1_CH1_IRQN  DMA1_Channel1_IRQn
#define RULOS_DMA1_CH2_IRQN  DMA1_Channel2_3_IRQn
#define RULOS_DMA1_CH3_IRQN  DMA1_Channel2_3_IRQn
#define RULOS_DMA1_CH4_IRQN  DMA1_Channel4_5_IRQn
#define RULOS_DMA1_CH5_IRQN  DMA1_Channel4_5_IRQn
#endif  // per-channel vs merged IRQ naming

/*
 * Per-channel hardware descriptor. Immutable, const, lives in .rodata
 * (flash only, zero RAM cost). The array is sized to cover all 16
 * possible G4 channels (DMA1 channels 1..8, DMA2 channels 1..8).
 * Variants like STM32G431 that only expose 6 channels per DMA leave
 * the upper slots zero-initialized; the allocator skips entries
 * whose `dma` pointer is NULL.
 *
 * The per-channel IRQ handlers at the bottom of this file hardcode
 * the array index they manage, so the designated initializer positions
 * are load-bearing:
 *   [0..7]  = DMA1 channels 1..8
 *   [8..15] = DMA2 channels 1..8
 */
typedef struct {
  DMA_TypeDef *dma;              // DMA1 or DMA2 (NULL = slot not populated)
  DMA_Channel_TypeDef *hw_ch;    // DMA1_Channel1, ...
  uint32_t ll_channel;           // LL_DMA_CHANNEL_1..8 (values 0..7)
  IRQn_Type irqn;
} dma_channel_hw_t;

#define DMA_CHANNEL_SLOTS 16

static const dma_channel_hw_t g_hw[DMA_CHANNEL_SLOTS] = {
#ifdef DMA1_Channel1_BASE
    [0] = {DMA1, DMA1_Channel1, LL_DMA_CHANNEL_1, RULOS_DMA1_CH1_IRQN},
#endif
#ifdef DMA1_Channel2_BASE
    [1] = {DMA1, DMA1_Channel2, LL_DMA_CHANNEL_2, RULOS_DMA1_CH2_IRQN},
#endif
#ifdef DMA1_Channel3_BASE
    [2] = {DMA1, DMA1_Channel3, LL_DMA_CHANNEL_3, RULOS_DMA1_CH3_IRQN},
#endif
#ifdef DMA1_Channel4_BASE
    [3] = {DMA1, DMA1_Channel4, LL_DMA_CHANNEL_4, RULOS_DMA1_CH4_IRQN},
#endif
#ifdef DMA1_Channel5_BASE
    [4] = {DMA1, DMA1_Channel5, LL_DMA_CHANNEL_5, RULOS_DMA1_CH5_IRQN},
#endif
#ifdef DMA1_Channel6_BASE
    [5] = {DMA1, DMA1_Channel6, LL_DMA_CHANNEL_6, RULOS_DMA1_CH6_IRQN},
#endif
#ifdef DMA1_Channel7_BASE
    [6] = {DMA1, DMA1_Channel7, LL_DMA_CHANNEL_7, RULOS_DMA1_CH7_IRQN},
#endif
#ifdef DMA1_Channel8_BASE
    [7] = {DMA1, DMA1_Channel8, LL_DMA_CHANNEL_8, RULOS_DMA1_CH8_IRQN},
#endif
#ifdef DMA2_Channel1_BASE
    [8] = {DMA2, DMA2_Channel1, LL_DMA_CHANNEL_1, RULOS_DMA2_CH1_IRQN},
#endif
#ifdef DMA2_Channel2_BASE
    [9] = {DMA2, DMA2_Channel2, LL_DMA_CHANNEL_2, RULOS_DMA2_CH2_IRQN},
#endif
#ifdef DMA2_Channel3_BASE
    [10] = {DMA2, DMA2_Channel3, LL_DMA_CHANNEL_3, RULOS_DMA2_CH3_IRQN},
#endif
#ifdef DMA2_Channel4_BASE
    [11] = {DMA2, DMA2_Channel4, LL_DMA_CHANNEL_4, RULOS_DMA2_CH4_IRQN},
#endif
#ifdef DMA2_Channel5_BASE
    [12] = {DMA2, DMA2_Channel5, LL_DMA_CHANNEL_5, RULOS_DMA2_CH5_IRQN},
#endif
#ifdef DMA2_Channel6_BASE
    [13] = {DMA2, DMA2_Channel6, LL_DMA_CHANNEL_6, RULOS_DMA2_CH6_IRQN},
#endif
#ifdef DMA2_Channel7_BASE
    [14] = {DMA2, DMA2_Channel7, LL_DMA_CHANNEL_7, RULOS_DMA2_CH7_IRQN},
#endif
#ifdef DMA2_Channel8_BASE
    [15] = {DMA2, DMA2_Channel8, LL_DMA_CHANNEL_8, RULOS_DMA2_CH8_IRQN},
#endif
};

