jelson/rulos/src/lib/chip/arm/stm32/core/dma.c
// DMA1 Channels 2 and 3 share one interrupt line.
void DMA1_Channel2_3_IRQHandler(void) {
  dispatch_channel_irq(1);  // DMA1 Channel 2
  dispatch_channel_irq(2);  // DMA1 Channel 3
}

#if defined(STM32G0B1xx)
// DMA1 Ch4-7 and DMA2 Ch1-5 share a single interrupt, along with
// DMAMUX1 overrun. We ignore DMAMUX overrun entirely -- the dispatch
// loop just checks every possible channel.
void DMA1_Ch4_7_DMA2_Ch1_5_DMAMUX1_OVR_IRQHandler(void) {
  dispatch_channel_irq(3);   // DMA1 Channel 4
  dispatch_channel_irq(4);   // DMA1 Channel 5
  dispatch_channel_irq(5);   // DMA1 Channel 6
  dispatch_channel_irq(6);   // DMA1 Channel 7
  dispatch_channel_irq(8);   // DMA2 Channel 1
  dispatch_channel_irq(9);   // DMA2 Channel 2
  dispatch_channel_irq(10);  // DMA2 Channel 3
  dispatch_channel_irq(11);  // DMA2 Channel 4
  dispatch_channel_irq(12);  // DMA2 Channel 5
}
#else
// Smaller G0 variants (G030/G031) have only 5 DMA1 channels and no
// DMA2. The merged handler name differs accordingly.
void DMA1_Ch4_5_DMAMUX1_OVR_IRQHandler(void) {
  dispatch_channel_irq(3);  // DMA1 Channel 4
  dispatch_channel_irq(4);  // DMA1 Channel 5
}
#endif  // STM32G0B1xx

#elif defined(RULOS_ARM_stm32c0)

// C0 has 3 DMA channels. Ch1 is standalone, Ch2-3 share a line.
// The DMAMUX1 overrun IRQ is separate (and unused -- we don't enable
// DMAMUX sync-overrun interrupts anywhere, so that vector stays
// at the default weak handler).
void DMA1_Channel1_IRQHandler(void) {
  dispatch_channel_irq(0);
}
void DMA1_Channel2_3_IRQHandler(void) {
  dispatch_channel_irq(1);  // DMA1 Channel 2
  dispatch_channel_irq(2);  // DMA1 Channel 3
}

#else  // F0

// F0 has the same three-handler layout as G0 but different names
// (no DMAMUX, so no DMAMUX1_OVR suffix).
void DMA1_Channel1_IRQHandler(void) {
  dispatch_channel_irq(0);
}
void DMA1_Channel2_3_IRQHandler(void) {
  dispatch_channel_irq(1);  // DMA1 Channel 2
  dispatch_channel_irq(2);  // DMA1 Channel 3
}
void DMA1_Channel4_5_IRQHandler(void) {
  dispatch_channel_irq(3);  // DMA1 Channel 4
  dispatch_channel_irq(4);  // DMA1 Channel 5
}

#endif  // per-chip IRQ handlers

// ============================================================================
// Stub backend -- H5.
//
// H5 has GPDMA -- a completely different controller architecture
// (linked-list descriptors, per-channel built-in request mux, no
// CCR register). No classic-DMA code works on it. No H5 driver
// currently uses DMA, so the stub holds the door until a GPDMA
// backend is written.
//
// rulos_dma_alloc returns NULL so callers that do the right thing
// (`if (ch == NULL) ...` or `assert(ch != NULL)`) fail loudly at
// init time instead of silently corrupting state. The other entry
// points __builtin_trap() because reaching them means a caller
// passed a bogus handle -- there's no defensible non-trapping
// behavior once you're down that path.
// ============================================================================
#else

rulos_dma_channel_t *rulos_dma_alloc(const rulos_dma_config_t *config) {
  (void)config;
  return NULL;
}

void rulos_dma_reconfigure(rulos_dma_channel_t *ch,
                           const rulos_dma_config_t *new_config) {
  (void)ch;
  (void)new_config;
  __builtin_trap();
}

void rulos_dma_start(rulos_dma_channel_t *ch, volatile void *periph_addr,
                     void *mem_addr, uint32_t nitems) {
  (void)ch;
  (void)periph_addr;
  (void)mem_addr;
  (void)nitems;
  __builtin_trap();
}

void rulos_dma_stop(rulos_dma_channel_t *ch) {
  (void)ch;
  __builtin_trap();
}

uint32_t rulos_dma_get_remaining(const rulos_dma_channel_t *ch) {
  (void)ch;
  __builtin_trap();
  return 0;
}

void rulos_dma_free(rulos_dma_channel_t *ch) {
  (void)ch;
  __builtin_trap();
}

#endif  // backend selection
